src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваПряжи</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ПроверочнаяВедомость</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваПряжиПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ПроверочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийКачество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяПеремоткаНеПроводилась</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБобин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПунктыПроверкиВизуальногоОсмотра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КСП_ЭтапыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ЭтапыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ЭтапыПроверкиКачестваПоЧекЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВизуальныйКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйОтвяз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Документ должен быть введен на основании проверочной ведомости", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		Отказ = ПроверкаНаличияЧекЛистаПоОснованию();
	КонецЕсли; 
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи.Получить(); 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере(Основание)
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.КСП_ЧекЛистПроверкиКачестваПряжи"));
	ДокументОбъект.Заполнить(Основание);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	Ответ = Вопрос("Заполнить документ на основании документа " + Объект.ДокументОснование + "?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ДокументОснование.Пустая() Тогда
		Сообщить("Сначала необходимо выбрать документ основание", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	ЗаполнитьНаОснованииНаСервере(Объект.ДокументОснование);
	ТоварыПриАктивизацииСтроки(Неопределено);
	Изображение = "";
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ответ = Вопрос("Данные документа будует перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	Если ПроверкаНаличияЧекЛистаПоОснованию() Тогда
		Объект.ДокументОснование = "";
	КонецЕсли;
	ЗаполнитьНаОснованииНаСервере(Объект.ДокументОснование);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.КонтрольнаяПеремотка.Доступность = Не Объект.КонтрольнаяПеремоткаНеПроводилась;
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные <> Неопределено Тогда
		Элементы.ПунктыПроверкиВизуальногоОсмотра.ТолькоПросмотр = СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена;
		Элементы.КонтрольнаяПеремотка.ТолькоПросмотр = СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена;
		Если Элементы.ЭтапыПроверки.ПодчиненныеЭлементы.ВкладкиЧекЛиста.ТекущаяСтраница.Имя = "ГруппаПунктыПроверкиВизуальногоОсмотра" Тогда
			Элементы.ФотоДефектов.ТолькоПросмотр = СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена;
		Иначе
			Элементы.ФотоДефектов.ТолькоПросмотр = СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена;
			Элементы.КонтрольнаяПеремоткаНеПроводилась.ТолькоПросмотр = СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена;
		КонецЕсли;
		Элементы.ПунктыПроверкиВизуальногоОсмотраВизуальныйОсмотрБезЗамечаний.Доступность = СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена;
		Элементы.ПунктыПроверкиВизуальногоОсмотраУбратьРезультатыПроверкиВизуальногоОсмотра.Доступность = СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьФотоПоКлючу(КлючСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиФотоДефектов.ПутьКФайлу,
		|	ЧекЛистПроверкиКачестваПряжиФотоДефектов.КлючСтроки,
		|	ЧекЛистПроверкиКачестваПряжиФотоДефектов.ЭтапПроверки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ФотоДефектов КАК ЧекЛистПроверкиКачестваПряжиФотоДефектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПутьКФайлу,
		|	ВТ.КлючСтроки,
		|	ВТ.ЭтапПроверки
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.КлючСтроки <> &КлючСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
	Запрос.УстановитьПараметр("ФотоДефектов", Объект.ФотоДефектов.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ФотоДефектов.Очистить();
	Объект.ФотоДефектов.Загрузить(РезультатЗапроса.Выгрузить());
	Изображение = "";
КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяПеремоткаНеПроводиласьПриИзменении(Элемент)
	УстановитьДоступность();
	Если Объект.КонтрольнаяПеремоткаНеПроводилась Тогда
		СтрокаТекущиеДанные = Элементы.КонтрольнаяПеремотка.ТекущиеДанные;
		Если СтрокаТекущиеДанные = Неопределено Тогда
			Возврат;		
		КонецЕсли;
		КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Отбор.Вставить("ЭтапПроверки", ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка"));
		ФотоДефектов = Объект.ФотоДефектов.НайтиСтроки(Отбор);
		Если ФотоДефектов.Количество() > 0 Тогда
			Ответ = Вопрос("По контрольной перемотке существуют фото дефектов. При установке признака они будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Объект.КонтрольнаяПеремоткаНеПроводилась = Ложь;
			Иначе
				УдалитьФотоПоКлючу(КлючСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаНаличияЧекЛистаПоОснованию()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжи.Ссылка
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи КАК ЧекЛистПроверкиКачестваПряжи
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжи.ДокументОснование = &ДокументОснование
		|	И ЧекЛистПроверкиКачестваПряжи.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("На основании документа " + Объект.ДокументОснование + " уже был создан " + ВыборкаДетальныеЗаписи.Ссылка + ". Необходимо работать в уже существующем документе", СтатусСообщения.Важное);
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;    
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)  	  
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеРезультатовВизуальногоОсмотра(Значениие, КлючСтроки)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("КлючСтроки", КлючСтроки);
	ЧекЛистПоНоменклатуре = Объект.ПунктыПроверкиВизуальногоОсмотра.НайтиСтроки(СтруктураОтбора);
	Для Каждого ПунктПроверки Из ЧекЛистПоНоменклатуре Цикл
		ПунктПроверки.РезультатПроверки = Значениие;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВизуальныйОсмотрБезЗамечаний(Команда)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Ответ = Вопрос("Все пункты чек-листа по номенклатуре " + СтрокаТекущиеДанные.Номенклатура + " " + СтрокаТекущиеДанные.ХарактеристикаНоменклатуры + " будут отмечены как успешно пройденные без замечаний. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	УстановитьЗначениеРезультатовВизуальногоОсмотра(Истина, СтрокаТекущиеДанные.КлючСтроки);
	СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена = Истина;
	СтрокаТекущиеДанные.ВизуальныйОсмотрДатаЗавершенияПроверки = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура УбратьРезультатыПроверкиВизуальногоОсмотра(Команда)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Ответ = Вопрос("Все результаты проверки по номенклатуре " + СтрокаТекущиеДанные.Номенклатура + " " + СтрокаТекущиеДанные.ХарактеристикаНоменклатуры + " будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	УстановитьЗначениеРезультатовВизуальногоОсмотра(Ложь, СтрокаТекущиеДанные.КлючСтроки);
	СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена = Ложь;
	СтрокаТекущиеДанные.ВизуальныйОсмотрДатаЗавершенияПроверки = "";	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПередУдалением(Элемент, Отказ)
	СтрокаТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
	Отказ = СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты;
	Если Отказ Тогда
		Сообщить("Этот пункт чек листа удалять нельзя", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Отбор.Вставить("ЭтапПроверки", ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль"));
	ФотоДефектов = Объект.ФотоДефектов.НайтиСтроки(Отбор);
	Если ФотоДефектов.Количество() > 0 Тогда
		Ответ = Вопрос("По этому пункту чек листа существуют фото дефектов. При установке признака они будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		Иначе
			УдалитьФотоПоКлючу(КлючСтроки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.Имя = "ПунктыПроверкиВизуальногоОсмотраПунктПроверки" Тогда
		СтрокаТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
		Отказ = СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты;
		Если Отказ Тогда
			Сообщить("Этот пункт чек листа изменять нельзя", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудникаПоТекущемуПользователю()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.ФизическоеЛицо = &Физлицо
		|	И СотрудникиОрганизаций.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиОрганизаций.ГоловнаяОрганизация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Физлицо",ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СотрудникиОрганизаций.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура КонтрольнаяПеремоткаПриИзменении(Элемент)
	Если Элемент.Имя <> "КонтрольнаяПеремоткаПроверил" Тогда
		СтрокаТекущиеДанные = Элементы.КонтрольнаяПеремотка.ТекущиеДанные;
		Если Не ЗначениеЗаполнено(СтрокаТекущиеДанные.Проверил) Тогда
			СтрокаТекущиеДанные.Проверил = ПолучитьСотрудникаПоТекущемуПользователю();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзображение(ПутьКФайлу, Файл)
	Попытка
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
			Изображение = ПоместитьВоВременноеХранилище(Новый Картинка(Файл), УникальныйИдентификатор);
		Иначе
			Изображение = ПоместитьВоВременноеХранилище(Новый Картинка, УникальныйИдентификатор);
		КонецЕсли;	
	Исключение
		Сообщить("Файл не найден. Возможно он был перемещен или удален", СтатусСообщения.Внимание);
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ФотоДефектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ТекущиеДанные.ПутьКФайлу, ".\\", "\");
	ПоказатьИзображение(ТекущиеДанные.ПутьКФайлу, Файл);
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элементы.ЭтапыПроверки.ПодчиненныеЭлементы.ВкладкиЧекЛиста.ТекущаяСтраница.Имя = "ГруппаПунктыПроверкиВизуальногоОсмотра" Тогда
		СтрокаТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
		Если СтрокаТекущиеДанные = Неопределено Тогда
			Сообщить("Необходимо выбрать конкретную строку с пунктом проверки визуального осмотра", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		ТекущийЭтапПроверки = ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль");
	Иначе
		Если Объект.КонтрольнаяПеремоткаНеПроводилась Тогда
			Сообщить("Установлен признак ""Контрольная перемотка не проводилась"". Для добавления фото дефектов, этот признак необходимо снять.", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		СтрокаТекущиеДанные = Элементы.КонтрольнаяПеремотка.ТекущиеДанные;
		Если СтрокаТекущиеДанные = Неопределено Тогда
			Сообщить("Необходимо выбрать конкретную строку в таблице контрольной перемотки", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		ТекущийЭтапПроверки = ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка");
	КонецЕсли;      	
	
	ТекущиеДанные = Элементы.ФотоДефектов.ТекущиеДанные;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл изображения дефекта";
	ДиалогОткрытияФайла.Каталог = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи;
	ДиалогОткрытияФайла.Фильтр = 
		"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.wmf;*.emf|" 
		+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
		+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
		+ "Формат TIFF (*.tif)|*.tif|"
		+ "Формат GIF (*.gif)|*.gif|"
		+ "Формат PNG (*.png)|*.png|"
		+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Каталог = РаботаСФайламиКлиент.СоздатьИлиНайтиКаталог(ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи);	 
		Если Каталог=неопределено тогда
			Возврат;
		Конецесли;
		Файл=ДиалогОткрытияФайла.ПолноеИмяФайла ;
		ТекущиеДанные.ПутьКФайлу = ".\" + Прав(Файл, СтрДлина(Файл) - СтрДлина(Каталог));
		ТекущиеДанные.КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
		ТекущиеДанные.ЭтапПроверки = ТекущийЭтапПроверки;
		ПоказатьИзображение(ТекущиеДанные.ПутьКФайлу, Файл);
		Если ТекущийЭтапПроверки = ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль") Тогда
			ПунктыПроверкиВизуальногоОсмотраПриАктивизацииСтроки(Неопределено);
		Иначе
			КонтрольнаяПеремоткаПриАктивизацииСтроки(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПутьКФайлуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ФотоДефектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ТекущиеДанные.ПутьКФайлу, ".\\", "\");
	ПоказатьИзображение(ТекущиеДанные.ПутьКФайлу, Файл);
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Сообщить("Необходимо выбрать конкретную строку с номенклатурой в таблице слева", СтатусСообщения.Внимание);
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	ТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.КлючСтроки) или НоваяСтрока Тогда
		ТекущиеДанные.КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;  	
		ТекущиеДанные.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Сообщить("Заполните таблицу ""Товары"" слева через функционал заполнения на основании", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Элементы.ПунктыПроверкиВизуальногоОсмотра.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	Элементы.КонтрольнаяПеремотка.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Изображение = "";
	КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Отбор.Вставить("ЭтапПроверки", ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль"));
	Элементы.ФотоДефектов.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяПеремоткаПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.КонтрольнаяПеремотка.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Изображение = "";
	КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Отбор.Вставить("ЭтапПроверки", ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка"));
	Элементы.ФотоДефектов.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ВкладкиЧекЛистаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ЭтапыПроверки.ПодчиненныеЭлементы.ВкладкиЧекЛиста.ТекущаяСтраница.Имя = "ГруппаПунктыПроверкиВизуальногоОсмотра" Тогда
		ПунктыПроверкиВизуальногоОсмотраПриАктивизацииСтроки(Неопределено);
	Иначе
		КонтрольнаяПеремоткаПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ФотоДефектовПутьКФайлуПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПроверкиВизуальногоОсмотраПунктПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТекущиеДанные = Элементы.ПунктыПроверкиВизуальногоОсмотра.ТекущиеДанные;
	Если СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты Тогда
		Сообщить("Этот пункт проверки был включен в чек лист автоматически. Удалению и изменению не подлежит", СтатусСообщения.Внимание);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяПеремоткаПунктПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТекущиеДанные = Элементы.КонтрольнаяПеремотка.ТекущиеДанные;
	Если СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты Тогда
		Сообщить("Этот пункт проверки был включен в чек лист автоматически. Удалению и изменению не подлежит", СтатусСообщения.Внимание);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаВыполненияЧекЛистаПоЭтапу(КлючСтроки, Этап)
	ЧекЛистВыполнен = Истина;
	
	Запрос = Новый Запрос;
	Если Этап = Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль Тогда   	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧекЛистПроверкиКачестваПряжиПунктыПроверкиВизуальногоОсмотра.ПунктПроверки,
			|	ЧекЛистПроверкиКачестваПряжиПунктыПроверкиВизуальногоОсмотра.РезультатПроверки,
			|	ЧекЛистПроверкиКачестваПряжиПунктыПроверкиВизуальногоОсмотра.КлючСтроки
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&ПунктыПроверкиВизуальногоОсмотра КАК ЧекЛистПроверкиКачестваПряжиПунктыПроверкиВизуальногоОсмотра
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.ПунктПроверки,
			|	ВТ.РезультатПроверки,
			|	ВТ.КлючСтроки
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.РезультатПроверки = ЛОЖЬ
			|	И ВТ.КлючСтроки = &КлючСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТ";
		
		Запрос.УстановитьПараметр("ПунктыПроверкиВизуальногоОсмотра", Объект.ПунктыПроверкиВизуальногоОсмотра.Выгрузить());
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЧекЛистПроверкиКачестваПряжиКонтрольнаяПеремотка.ПунктПроверки,
			|	ЧекЛистПроверкиКачестваПряжиКонтрольнаяПеремотка.РезультатПроверки,
			|	ЧекЛистПроверкиКачестваПряжиКонтрольнаяПеремотка.КлючСтроки
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&КонтрольнаяПеремотка КАК ЧекЛистПроверкиКачестваПряжиКонтрольнаяПеремотка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.ПунктПроверки,
			|	ВТ.РезультатПроверки,
			|	ВТ.КлючСтроки
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.РезультатПроверки = НЕОПРЕДЕЛЕНО
			|	И ВТ.КлючСтроки = &КлючСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТ";
		
		Запрос.УстановитьПараметр("КонтрольнаяПеремотка", Объект.КонтрольнаяПеремотка.Выгрузить());		
	КонецЕсли;
	Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЧекЛистВыполнен = Ложь;
		Сообщить("Пункт проверки " + ВыборкаДетальныеЗаписи.ПунктПроверки + " не был выполнен. Установка признака завершения этапа контроля невозможна.", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Возврат ЧекЛистВыполнен;
КонецФункции

&НаКлиенте
Процедура ТоварыВизуальныйОсмотрПроверкаЗавершенаПриИзменении(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;	
	Если СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена Тогда
		Если Не ПроверкаВыполненияЧекЛистаПоЭтапу(СтрокаТекущиеДанные.КлючСтроки, 
			ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль")) Тогда
			СтрокаТекущиеДанные.ВизуальныйОсмотрПроверкаЗавершена = Ложь;
			Возврат;
		КонецЕсли;
		СтрокаТекущиеДанные.ВизуальныйОсмотрДатаЗавершенияПроверки = ТекущаяДата();
	Иначе
		СтрокаТекущиеДанные.ВизуальныйОсмотрДатаЗавершенияПроверки = "";
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКонтрольнаяПеремоткаПроверкаЗавершенаПриИзменении(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Если СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена Тогда
		Если Не ПроверкаВыполненияЧекЛистаПоЭтапу(СтрокаТекущиеДанные.КлючСтроки,
			ПредопределенноеЗначение("Перечисление.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка")) Тогда
			СтрокаТекущиеДанные.КонтрольнаяПеремоткаПроверкаЗавершена = Ложь;
			Возврат;
		КонецЕсли;
		СтрокаТекущиеДанные.КонтрольнаяПеремоткаДатаЗавершенияПроверки = ТекущаяДата();
	Иначе
		СтрокаТекущиеДанные.КонтрольнаяПеремоткаДатаЗавершенияПроверки = "";
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
